* Config

#+BEGIN_SRC sh :eval no-export :results output :exports results
cat rainmaker/rainmaker.ino | sed -n -e '/^ConfigSlot /,/\};/p'
#+END_SRC

#+RESULTS:
#+begin_example
ConfigSlot slots[CONFIG_SLOTS] = {
  {
    "TH"                // warm temperature threshold
    ,&temp_too_treshold
    ,5                  // increment by 5 degrees
    ,50                 // max 50 deg
    ,20                 // min 20 deg
    ,1                  // save to eeprom 0 address
  },
  {
    "RH"                // dry/humid threshold
    ,&relative_humidity_treshold
    ,5                  // increment
    ,100                // max
    ,30                 // min
    ,2                  // save to EEPROM address slot
  },
  {
    "IDLE"              // Timeout before blanking LCD
    ,&idle_timeout      // idle timeout (seconds)
    ,30                 // increment
    ,600                // max 10 min
    ,30                 // min
    ,3                  // save to EEPROM address slot
  },
  {
    "DEL"               // Rain delay, number of ticks between showers
    ,&rain_delay        // delay * 15 mins between rain showever
    ,1                  // increment by slot count
    ,RAIN_DELAY_MAX     // max 8*15 mins = 2 hours
    ,1                  // min 1 slot = 15 mins
    ,4                  // save to EEPROM address slot
  },
  {
    "DUR"               // Rain duration = length of shower
    ,&rain_duration     // delay * 15 mins between rain showever
    ,10                 // increment 10 sec slots
    ,120                // max 120 secs = 2 minutes
    ,10                 // min 10 secs
    ,5                  // save to EEPROM address slot
  },
  {
    "TMR"               // Current counter value, allow change but NOT persist
    ,&rainTimer         // delay * 15 mins between rain showever
    ,RAIN_DELAY_TICK    // increment counter by tick size
    ,RAIN_DELAY_TICK * RAIN_DELAY_MAX 
                        // max to rain delay = number of ticks between showers
    ,0                  // min = start counter from 0
    ,0                  // NOT saved to EEPROM
  }  
};
#+end_example


